# -*- coding: utf-8 -*-

class PredefinedTexts():
    
    # help message
    helpMsg = u'我是迪特敏奈森，是個機器人，最喜歡幫別人做決定，但如果你以為有真人在回你，那你一定是搞錯什麼了 (≧∀≦)ゞ\n' +\
                u'我還不是很聰明，所以請用我理解的方式跟我說話：\n' +\
                u'1. 用「你是誰」來讓我自我介紹\n' +\
                u'2. 用含有「Ｏ不Ｏ」的是非問句來讓我替你做決定（例：我好聰明對不對）\n' +\
                u'3. 對我「QQ」來跟我討拍拍'
    
    # prefix
    prefixes = ['',
                u'可能',
                u'應該',
                u'一定',
                u'或許',
                u'當然',
                u'大概',
                u'絕對',
                u'我想想喔...']
    
    # postfix
    postfixes = ['',
                 u'啊',
                 u'啦',
                 u'吧',
                 u'喔']
    
    # no answer
    noAnswers = [u'這不好說',
                 u'我也不太確定',
                 u'你自己再想清楚好了',
                 u'這我不敢幫你決定',
                 u'不知道']    
    
    # emoji
    emojis = [ur'σ(´∀｀*)',
              ur'ρ(・ω・、)',
              ur'(・`ω´・)',
              ur'(・ε・)',
              ur'(ง๑ •̀_•́)ง',
              ur'(っ´ω`c)',
              ur'ヾ(*´∀ ˋ*)ﾉ',
              ur'(ﾟдﾟ)',
              ur'( • ̀ω•́ )',
              ur'(((ﾟДﾟ;)))',
              ur'(๑•̀ㅂ•́)و✧',
              ur'٩(๑•̀ω•́๑)۶',
              ur'(๑•́ ₃ •̀๑)',
              ur'(´c_`)',
              ur'(´_ゝ`)',
              ur'( ˘･з･)']
    
    # hint messages
    hintMsgs = [u'聽不懂，你是新朋友嗎，可以先問我「你是誰」喔',
                u'我不太懂你的意思',
                u'換個方式再說一次好嗎',
                u'你剛剛說了什麼啊，我聽不懂']
    
    # cry messages
    cryMsgs = [ur'( ´･･)ﾉ(._.`)']
    
    

